driver-tests/bpelse/assign/DecimalPointError/src/Math.wsdl

<?xml version="1.0" encoding="UTF-8"?>
<definitions name="Math" targetNamespace="http://j2ee.netbeans.org/wsdl/RoundingError/Math"
    xmlns="http://schemas.xmlsoap.org/wsdl/"
    xmlns:wsdl="http://schemas.xmlsoap.org/wsdl/"
    xmlns:xsd="http://www.w3.org/2001/XMLSchema" xmlns:tns="http://j2ee.netbeans.org/wsdl/RoundingError/Math" xmlns:ns="http://xml.netbeans.org/schema/MathInput" xmlns:plnk="http://docs.oasis-open.org/wsbpel/2.0/plnktype" xmlns:soap="http://schemas.xmlsoap.org/wsdl/soap/">
    <types>
        <xsd:schema targetNamespace="http://j2ee.netbeans.org/wsdl/RoundingError/Math">
            <xsd:import namespace="http://xml.netbeans.org/schema/MathInput" schemaLocation="Math.xsd"/>
        </xsd:schema>
    </types>
    <message name="MathOperationRequest">
        <part name="reqpart" element="ns:Request"/>
    </message>
    <message name="MathOperationResponse">
        <part name="res_part" element="ns:Response"/>
    </message>
    <portType name="MathPortType">
        <operation name="MathOperation">
            <input name="input1" message="tns:MathOperationRequest"/>
            <output name="output1" message="tns:MathOperationResponse"/>
        </operation>
    </portType>
    <binding name="MathBinding" type="tns:MathPortType">
        <soap:binding style="document" transport="http://schemas.xmlsoap.org/soap/http"/>
        <operation name="MathOperation">
            <soap:operation/>
            <input name="input1">
                <soap:body use="literal"/>
            </input>
            <output name="output1">
                <soap:body use="literal"/>
            </output>
        </operation>
    </binding>
    <service name="MathService">
        <port name="MathPort" binding="tns:MathBinding">
            <soap:address location="http://localhost:${HttpDefaultPort}/MathService/MathPort"/>
        </port>
    </service>
    <plnk:partnerLinkType name="Math">
        <!-- A partner link type is automatically generated when a new port type is added. Partner link types are used by BPEL processes. 
In a BPEL process, a partner link represents the interaction between the BPEL process and a partner service. Each partner link is associated with a partner link type.
A partner link type characterizes the conversational relationship between two services. The partner link type can have one or two roles.-->
        <plnk:role name="MathPortTypeRole" portType="tns:MathPortType"/>
    </plnk:partnerLinkType>
</definitions>

