driver-tests/bpelse/assign/DecimalPointErrorCA/test/TestCase1/Input.xml

<soapenv:Envelope xsi:schemaLocation="http://schemas.xmlsoap.org/soap/envelope/ http://schemas.xmlsoap.org/soap/envelope/" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xmlns:xsd="http://www.w3.org/2001/XMLSchema" xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:mat="http://xml.netbeans.org/schema/MathInput">
  <soapenv:Body>
    <mat:Request>
      <mat:ValueList>
        <!--1 or more repetitions:-->
        <mat:Value>245.2480</mat:Value>
        <mat:Value>139.0370</mat:Value>
        <mat:Value>919.0220</mat:Value>
        <mat:Value>113.9320</mat:Value>
        <mat:Value>435.2980</mat:Value>
        <mat:Value>4410.5290</mat:Value>
      </mat:ValueList>
    </mat:Request>
  </soapenv:Body>
</soapenv:Envelope>